# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.033328  2.023161  0.427778
c  0.222881  0.203050  1.471031
e -1.127872  1.021611 -1.044529
f  0.729757 -0.929305  0.190731
h -1.494632 -0.006354 -2.319657

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.033328  2.023161  0.427778  bar   True
c  0.222881  0.203050  1.471031  bar   True
e -1.127872  1.021611 -1.044529  bar  False
f  0.729757 -0.929305  0.190731  bar   True
h -1.494632 -0.006354 -2.319657  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.033328  2.023161  0.427778  bar   True
b       NaN       NaN       NaN  NaN    NaN
c  0.222881  0.203050  1.471031  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -1.127872  1.021611 -1.044529  bar  False
f  0.729757 -0.929305  0.190731  bar   True
g       NaN       NaN       NaN  NaN    NaN
h -1.494632 -0.006354 -2.319657  bar  False

# Your Turn Here

Do you still remember how to index a row/column?

In [5]:
#### index row 'c' below
df2.loc['c']

one      0.222881
two       0.20305
three     1.47103
four          bar
five         True
Name: c, dtype: object

In [6]:
#### index column 'two' below
df2.two

a    2.023161
b         NaN
c    0.203050
d         NaN
e    1.021611
f   -0.929305
g         NaN
h   -0.006354
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [7]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [8]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [9]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN  2.023161
c       NaN  0.203050
e       NaN  1.021611
f  0.729757 -0.929305
h -1.494632 -0.006354

In [10]:
b = df[['one','two','three']]
b

        one       two     three
a  0.033328  2.023161  0.427778
c  0.222881  0.203050  1.471031
e -1.127872  1.021611 -1.044529
f  0.729757 -0.929305  0.190731
h -1.494632 -0.006354 -2.319657

In [11]:
a + b

        one  three       two
a       NaN    NaN  4.046322
c       NaN    NaN  0.406101
e       NaN    NaN  2.043221
f  1.459514    NaN -1.858609
h -2.989264    NaN -0.012709

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [12]:
b + a

        one  three       two
a       NaN    NaN  4.046322
c       NaN    NaN  0.406101
e       NaN    NaN  2.043221
f  1.459514    NaN -1.858609
h -2.989264    NaN -0.012709

In [13]:
a['one'].dropna()

f    0.729757
h   -1.494632
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [14]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  2.023161
c  0.203050
e  1.021611
f -0.929305
h -0.006354

In [15]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  4.046322
c       NaN  0.406101
e       NaN  2.043221
f  1.459514 -1.858609
h -2.989264 -0.012709

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [16]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  4.046322
c       NaN  0.406101
e       NaN  2.043221
f  1.459514 -1.858609
h -2.989264 -0.012709

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [17]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [18]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [19]:
# forward-fill
# used with time series data
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [20]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [21]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a       NaN -0.656870  0.522882
b       NaN       NaN       NaN
c  0.499848  0.529952  0.613839
d  1.471869 -0.221573       NaN
e  1.821283  1.827116 -0.112704

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [29]:
#### insert your code here

rand_df.one.fillna(1, inplace = True)
rand_df.two.fillna(method='ffill', inplace = True)
rand_df.three.fillna(method='bfill', inplace = True)
rand_df

        one       two     three
a  1.000000 -0.656870  0.522882
b  1.000000 -0.656870  0.613839
c  0.499848  0.529952  0.613839
d  1.471869 -0.221573 -0.112704
e  1.821283  1.827116 -0.112704

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [24]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a  0.050479  0.526442  0.686062
b       NaN -0.083747       NaN
c -2.261710       NaN -0.748011
d  0.529831  0.773926 -0.404720
e  1.355806 -0.944485 -0.247623

In [25]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [26]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A   -0.081398
B    0.068034
C   -0.178573
dtype: float64

In [27]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a  0.050479  0.526442  0.686062
b -0.081398 -0.083747 -0.178573
c -2.261710  0.068034 -0.748011
d  0.529831  0.773926 -0.404720
e  1.355806 -0.944485 -0.247623

In [28]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.

stuart weinstein